# Titanic problem

In [634]:
import pandas as pd
data = pd.read_csv("./data/titanic.csv")
data_aufgabe3=data
data_aufgabe3_2=data

In [635]:
print(data.shape)
data.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [636]:
data=data.drop(["PassengerId", "Sex", "Ticket", "Cabin", "Embarked","Name"], axis=1)
print(data.shape)
data.head(10)

(891, 6)

   Survived  Pclass   Age  SibSp  Parch     Fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500
5         0       3   NaN      0      0   8.4583
6         0       1  54.0      0      0  51.8625
7         0       3   2.0      3      1  21.0750
8         1       3  27.0      0      2  11.1333
9         1       2  14.0      1      0  30.0708

In [637]:
data=data.dropna()
print(data.shape)
data.head()

(714, 6)

   Survived  Pclass   Age  SibSp  Parch     Fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [638]:
from sklearn.model_selection import train_test_split

In [639]:
x_train, x_test, y_train, y_test = train_test_split(data, data["Survived"], test_size=0.2, random_state=0)
print("Trainingsdatenpunkte:", len(x_train))
print("Testdatenpunkte:", len(x_test))

Trainingsdatenpunkte: 571
Testdatenpunkte: 143

In [640]:
from sklearn.linear_model import LogisticRegression
logisticRegr = LogisticRegression(max_iter=1000)
logisticRegr.fit(x_train, y_train)

LogisticRegression(max_iter=1000)

In [641]:
predictions = logisticRegr.predict(x_test)

In [642]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test, predictions)

1.0

In [643]:
from sklearn.metrics import precision_score
precision_score(y_test, predictions)

1.0

In [644]:
from sklearn.metrics import recall_score
recall_score(y_test, predictions)

1.0

In [645]:
#function classification report geht auch

Aufgabe 3

In [646]:
data_aufgabe3=data_aufgabe3.drop(["PassengerId", "Ticket", "Cabin", "Embarked","Name"], axis=1)
data_aufgabe3=data_aufgabe3.dropna()
print(data_aufgabe3.shape)
data_aufgabe3.head(10)

(714, 7)

    Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0          0       3    male  22.0      1      0   7.2500
1          1       1  female  38.0      1      0  71.2833
2          1       3  female  26.0      0      0   7.9250
3          1       1  female  35.0      1      0  53.1000
4          0       3    male  35.0      0      0   8.0500
6          0       1    male  54.0      0      0  51.8625
7          0       3    male   2.0      3      1  21.0750
8          1       3  female  27.0      0      2  11.1333
9          1       2  female  14.0      1      0  30.0708
10         1       3  female   4.0      1      1  16.7000

In [647]:
data_aufgabe3["is-Female"]= data_aufgabe3.apply(lambda row: row["Sex"] =="female" , axis=1)
data_aufgabe3.head(10)

    Survived  Pclass     Sex   Age  SibSp  Parch     Fare  is-Female
0          0       3    male  22.0      1      0   7.2500      False
1          1       1  female  38.0      1      0  71.2833       True
2          1       3  female  26.0      0      0   7.9250       True
3          1       1  female  35.0      1      0  53.1000       True
4          0       3    male  35.0      0      0   8.0500      False
6          0       1    male  54.0      0      0  51.8625      False
7          0       3    male   2.0      3      1  21.0750      False
8          1       3  female  27.0      0      2  11.1333       True
9          1       2  female  14.0      1      0  30.0708       True
10         1       3  female   4.0      1      1  16.7000       True

In [648]:
data_aufgabe3=data_aufgabe3.drop(["Sex"], axis=1)

In [649]:
x_train, x_test, y_train, y_test = train_test_split(data_aufgabe3, data_aufgabe3["Survived"], test_size=0.2, random_state=0)
print("Trainingsdatenpunkte:", len(x_train))
print("Testdatenpunkte:", len(x_test))

Trainingsdatenpunkte: 571
Testdatenpunkte: 143

In [650]:
logisticRegr = LogisticRegression(max_iter=1000)
logisticRegr.fit(x_train, y_train)

LogisticRegression(max_iter=1000)

In [651]:
predictions = logisticRegr.predict(x_test)

In [652]:
accuracy_score(y_test, predictions)

1.0

In [653]:
precision_score(y_test, predictions)

1.0

In [654]:
recall_score(y_test, predictions)

1.0

embarked als feature nutzen

In [655]:
data_aufgabe3_2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [656]:
data_aufgabe3_2=data_aufgabe3_2.drop(["PassengerId", "Ticket", "Cabin", "Sex","Name"], axis=1)

In [660]:
data_aufgabe3_2.apply(lambda a: 1 if a["Embarked"] =="S" else a["Embarked"], axis=1 )
data_aufgabe3_2.apply(lambda a: 1 if a["Embarked"] =="S" else a["Embarked"], axis=1 )


print(data_aufgabe3_2)

     Survived  Pclass   Age  SibSp  Parch     Fare Embarked Embarked_new
0           0       3  22.0      1      0   7.2500        S            1
1           1       1  38.0      1      0  71.2833        C            C
2           1       3  26.0      0      0   7.9250        S            1
3           1       1  35.0      1      0  53.1000        S            1
4           0       3  35.0      0      0   8.0500        S            1
..        ...     ...   ...    ...    ...      ...      ...          ...
886         0       2  27.0      0      0  13.0000        S            1
887         1       1  19.0      0      0  30.0000        S            1
888         0       3   NaN      1      2  23.4500        S            1
889         1       1  26.0      0      0  30.0000        C            C
890         0       3  32.0      0      0   7.7500        Q            Q

[891 rows x 8 columns]